//КЕКЕКЕКЕКЕКЕКЕКЕК
//
//
//ыфкфыыыыыыыыыыыыыыыыфыфыфыфыффы
//КЕКЕКЕК
&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)

	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекстСообщения = "Поменялась цена в строке";

КонецПроцедуры



&НаКлиенте
Функция ОписаниеПользователя()
	
	Человек = Новый Структура;
	Человек.Вставить("Имя", "Антон");
	Человек.Вставить("Стаж", 15);
	Человек.Вставить("ДатаПриема", ТекущаяДата());
	Человек.Вставить("Штатный", Истина);
	
КонецФункции