#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает остатки номенклатуры по складам.
//
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура - Номенклатура, по которой необходимо получить остатки.
//  Склады - Массив - Массив складов, по которым необходимо получить 
Функция ОстаткиНоменклатуры(Номенклатура, Склады) Экспорт
	
	Результат = Новый Соответствие;
	
	Для Каждого Склад Из Склады Цикл
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.Склад КАК Склад,
		|	ТоварыНаСкладахОстатки.КоличествоОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Номенклатура = &Номенклатура И Склад = &Склад) КАК ТоварыНаСкладахОстатки";
		
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Запрос.УстановитьПараметр("Склад", Склад);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Результат.Вставить(Выборка.Склад, Выборка.Количество);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	

КонецФункции

Функция ПолучитьОстаткиПоСкладу(Склад) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ТоварыНаСкладахОстатки.КоличествоОстаток * ТоварыНаСкладахОстатки.Цена КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(&Склад, Неопределено) КАК ТоварыНаСкладахОстатки";
	
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаЗначений = РезультатЗапроса.Выгрузить();
	
	Возврат ТаблицаЗначений;
	
КонецФункции


#КонецОбласти